Examinator/src/Enums/ДействияПослеИстеченияВремениЭлектронногоКурса/ДействияПослеИстеченияВремениЭлектронногоКурса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ДействияПослеИстеченияВремениЭлектронногоКурса</name>
  <comment>timeLimitAction</comment>
  <enumValues>
    <name>Выйти</name>
    <comment>exit,no message</comment>
  </enumValues>
  <enumValues>
    <name>СообщитьИВыйти</name>
    <comment>exit,message</comment>
  </enumValues>
  <enumValues>
    <name>ПродолжитьРаботу</name>
    <comment>continue,no message</comment>
  </enumValues>
  <enumValues>
    <name>СообщитьИПродолжитьРаботу</name>
    <comment>continue,message</comment>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ДействияПослеИстеченияВремениЭлектронногоКурса/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ЗначениеSCORM(ДействиеПослеИстеченияВремени) Экспорт
	
	Если ЗначениеЗаполнено(ДействиеПослеИстеченияВремени) Тогда
		
		Если ДействиеПослеИстеченияВремени = Перечисления.ДействияПослеИстеченияВремениЭлектронногоКурса.СообщитьИВыйти Тогда
			Возврат "exit,message";
		КонецЕсли;
		
		Если ДействиеПослеИстеченияВремени = Перечисления.ДействияПослеИстеченияВремениЭлектронногоКурса.Выйти Тогда
			Возврат "exit,no message";
		КонецЕсли;
		
		Если ДействиеПослеИстеченияВремени = Перечисления.ДействияПослеИстеченияВремениЭлектронногоКурса.СообщитьИПродолжитьРаботу Тогда
			Возврат "continue,message";
		КонецЕсли;
		
		Если ДействиеПослеИстеченияВремени = Перечисления.ДействияПослеИстеченияВремениЭлектронногоКурса.ПродолжитьРаботу Тогда
			Возврат "continue,no message";
		КонецЕсли;
		
	Иначе
		
		Возврат "continue,no message";
		
	КонецЕсли;	
	
КонецФункции

#КонецОбласти

#КонецЕсли
